from database import add_agent

# add_agent(
#     name='',
#     faction='',
#     description='',
#     photo_url=''
# )
if __name__ == '__main__':
    # Агенты Хитрые зайцы
    add_agent(
        name='Николь Демара',
        faction='Хитрые зайцы',
        description="Лидер агентства по мелким поручениям «Хитрые Зайцы», которое берётся за любые заказы, связанные с Пустотами. Много лет провела на улицах и заработала среди коллег репутацию крайне хитрой особы. Многие клиенты внесли её в чёрный список из-за её подхода «всё или ничего». Обожает деньги, но, как ни странно, абсолютно не умеет ими распоряжаться, из-за чего «Хитрые Зайцы» постоянно находятся на грани банкротства и в долгах по уши.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Nicole.png'
    )
    add_agent(
        name='Энби Демара',
        faction='Хитрые зайцы',
        description="Загадочная молодая девушка, которая никогда не говорит о своём прошлом — будто его у неё и вовсе не было. Спокойна и собрана, в бою проявляет неестественно высокую компетентность и эффективность, как будто за плечами годы подготовки. После одного неожиданного инцидента Николь привела её в «Хитрые Зайцы», и с тех пор она эмоционально привязана к ней. Любит смотреть фильмы, но из-за некоторой наивности порой воспринимает их как реальные истории.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Anby.png'
    )
    add_agent(
        name='Билли Кид',
        faction='Хитрые зайцы',
        description="Красавчик-киборг с лёгким и беззаботным характером. Он ярый фанат шоу «Рыцари Света» — не только называет себя одним из них, но и постоянно повторяет культовые фразы из передачи. Свои особые кастомные крупнокалиберные револьверы он называет «леди» — судя по всему, это был подарок от старого друга. С виду может показаться ненадёжным, но стоит Билли настроиться всерьёз — он справится с любой задачей.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Billy.png'
    )
    add_agent(
        name='Нэкомия Мана',
        faction='Хитрые зайцы',
        description="Озорная и шустрая, она обожает подшучивать над другими. Твой кошелёк — это её кошелёк. (Нет, серьёзно... теперь он действительно её.) Спортивная и бесстрашная, для неё не существует слишком опасных Пустот. Стереотип «кошки любят рыбу» на самом деле неверный. Но Некомата рыбу действительно обожает... На её глазах было немало «кош-астроф» и моментов в стиле «любопытной кошке нос оторвали», и она знает кучу тайн, которые нельзя рассказывать.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Nekomata.png'
    )
    # Агенты Виктория Хаускпинг
    add_agent(
        name='Люкаон',
        faction='Домашний сервис Виктория',
        description="Может разобраться с любым делом. Самый надёжный из помощников и крепкая опора для любой команды. Рассудительный и мудрый, настоящий джентльмен, который не потерпит ни единого пятнышка. Предан тому, кого сам выбрал, без остатка. Несмотря на утончённую и рациональную внешность, в нём таится дикость, которая проявляется перед лицом определённых опасностей.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Lycoan.png'
    )
    add_agent(
        name='Александрина',
        faction='Домашний сервис Виктория',
        description="Танец летней ночи — нежная и утончённая мелодия льётся сквозь движения Рины."
"Концерт Извращённой Судьбы — дополнительная музыка, исполняемая куклами. Лучше всего слушать внимательно."
"Симфония Нового Мира — волнующая, мощная и элегантная. Даже когда лупит людей, Рина остаётся утончённой."
"Безмолвная Соната Патетика — саундтрек, который звучит в головах многих, когда Рина заходит на кухню.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Rina.png'
    )
    add_agent(
        name='Корин Уикс',
        faction='Домашний сервис Виктория',
        description="Домашние дела или хер с ними — всё оставь ей!"
    "(Ой, эээ? Н-но я не такая уж и крутая!)"
    "Она послушная, трудяга и ответственная, и не боится тяжёлой работы!"
    "(Минутку! Это точно не я!)"
    "Она никогда не даст товарищам страдать и всегда берёт ответственность на себя!"
    "(Послушайте меня! Такие преувеличения клиентов введут в заблуждение!)"
    "Лучше домоправительницы, чем Корин, не найдёшь!"
    "(Ооо, пожалуйста, не разсылай этот отчёт! Это не настоящая я!)",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Corin.png'
    )
    add_agent(
        name='Эллен Джое',
        faction='Домашний сервис Виктория',
        description="Меньше — значит больше, простота — ключ. "
    "Здесь нет места сложности. Просто держи всё просто.  "
    "Работай умно и отдыхай больше. "
    "Делай перерывы вовремя... чтобы минимизировать раздражение от работы.  "
    "Работай сосредоточенно, побеждай осторожно. "
    "Если она слишком серьёзно относится или недостаточно — страдает враг.  "
    "Раскрой сладкое удовольствие, разворачивай и наслаждайся. "
    "Наслаждаясь леденцом и скрывая свои истинные мысли.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Ellen.png'
    )
    # Агенты Белобог
    add_agent(
        name='Коляда Белобог',
        faction='Строительная компания Белобог',
        description="Маленькая и милая, но с серьёзной боевой мощью. "
    "Она может быть маленькой, но уверенно размахивает этим огромным молотом.  "
    "Свирепая молодая девушка, которая ещё и президент. "
    "Молодой лидер во главе Belobog Industries.  "
    "Президент, которая ведёт примером. "
    "Она предпочитает работать на месте событий, а не сидеть за столом.  "
    "Ведёт примером, сохраняя свою милую натуру. "
    "Иногда её зрелость уступает место детской непосредственности. Она лидер, о которой порой нужно заботиться её последователям.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/koleda.png'
    )
    add_agent(
        name='Грейс Ховард',
        faction='Строительная компания Белобог',
        description= "\"Ты сказал Грейс?\" — воскликнул Ключ и ответил: "
    "\"Хм, она первая, кто был достаточно мил, чтобы сделать мне массаж.\"  "
    "\"Она действительно заботливая,\" — быстро добавил Шуруп: "
    "\"Вместо того чтобы быть слишком тугой, я предпочитаю её способ закручивать шурупы в самый раз.\"  "
    "В этот момент подключился Шестерня: "
    "\"Её ум умен и изящен, как хорошо отлаженная коробка передач!\"  "
    "\"И очень рациональна,\" — пробормотал Масло: "
    "\"В её словаре нет места для 'немного' или 'в меру'. Всё точно — в миллилитрах.\"",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/grace.png'
    )
    add_agent(
        name='Бен Биггер',
        faction='Строительная компания Белобог',
        description="Крепкое тело и честная душа. "
    "Эти лапы могут ломать кости, но к счастью, они заняты стуком по калькулятору.  "
    "Ест рыбу и сохраняет её целой. "
    "Находит лёгкий баланс между борьбой с бандитами на поле боя и возвращением к бухгалтерии во время мира... Единственное, что могло бы сделать всё лучше — банка икры.  "
    "Пушистый мех, но никакой мутной математики. "
    "Естественно чувствителен к числам, тщательно ведёт учёт и запомнил все 58 бухгалтерских книг в своём офисе.  "
    "Отплачивает признанием лояльностью. "
    "После 1 года и 321 дня работы Коледа повысила его до начальника финансов, и с тех пор он верно ей служит.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Ben.png'
    )
    add_agent(
        name='Антон Иванов',
        faction='Строительная компания Белобог',
        description="Ведёт других своей страстью к работе. "
    "Старший сотрудник Belobog Industries, он — прораб на объекте, всегда готовый к делу.  "
    "Энергичный и надёжный. "
    "Полон энергии и всегда справляется с задачами.  "
    "Добросердечный, несмотря на внешний вид. "
    "С острым языком, но мягким сердцем, он не может сказать 'нет' нуждающимся.  "
    "Сильный, искренний и прямолинейный. "
    "Открытый и честный, ничто не может его вывести из себя.",
        photo_url='/home/null/PycharmProjects/Telegram-Bots/First level/FIrst_Bot/photo/Anton.png'
    )